{
  "entries": [
    {
      "id": 2,
      "date": "2020-08-10",
      "concept": "Bash",
      "entry": "We talked about some basic bash commands for terminal.",
      "moodId": 1
    },
    {
      "id": 3,
      "date": "2020-08-12",
      "concept": "Networking",
      "entry": "Met big sibling Connor. He gave me a heads up to be sure to pay attention closely to GIT",
      "moodId": 1
    },
    {
      "id": 4,
      "date": "2020-08-13",
      "concept": "Git",
      "entry": "We learned the basics of git and were put into groups for our group project. I was on the pomelos",
      "moodId": 1
    },
    {
      "id": 5,
      "date": "2020-08-25",
      "concept": "JavaScript array methods",
      "entry": "We learned about some methods to work with arrays. Apparently map is going to be suport important so I should do some more research on it",
      "moodId": 2
    },
    {
      "id": 6,
      "date": "2020-08-26",
      "concept": "Lab time!!!",
      "entry": "We had a lot of lab time today, which was well needed! I was able to start my Daily Journal project over and make some progress",
      "moodId": 1
    },
    {
      "id": 7,
      "date": "2020-08-27",
      "concept": "JavaScript",
      "entry": "We worked on a project that was all about working with arrays and representing them on the DOM",
      "moodId": 2
    },
    {
      "date": "2020-09-16",
      "concept": "Databases, Entity Relationship Diagrams",
      "entry": "Today we were introduced to databases and the impotance of entity relationship diagrams",
      "moodId": 1,
      "id": 8
    },
    {
      "date": "2020-09-21",
      "concept": "Databases ERD",
      "entry": "Today we worked on our understanding of ERDs and looked at some json-server api call methods. Then, we looked at the way Brenda laid out her Lego project to see how that all worked!",
      "moodId": 1,
      "id": 9
    },
    {
      "date": "2020-09-21",
      "concept": "Deleting posts",
      "entry": "Today, I was able to add the ability to delete entries to my Daily Journal project. Since I had done this before, it was super easy and only took about 20 minutes. Hooray!",
      "moodId": 1,
      "id": 10
    },
    {
      "date": "2020-09-22",
      "concept": "Edit",
      "entry": "Today Brenda showed us how the update portion of CRUD!",
      "moodId": 2,
      "id": 11
    },
    {
      "date": "2020-09-30",
      "concept": "Group Project Demos!!!",
      "entry": "Today we demonstrated our Nutshell group project, which was a social networking site we build with three other team members. Crazy how far we've come in 8 weeks!!!!!!",
      "moodId": 1,
      "id": 12
    },
    {
      "date": "2020-10-01",
      "concept": "Lab time / Array Methods",
      "entry": "During lab time today, I completed a task that was to create a variety of functions using different array methods to give an expected return. I completed the assignment and the advanced challenge without having to use any 'for' loops in the process!",
      "moodId": 1,
      "id": 13
    },
    {
      "date": "2020-10-02",
      "concept": "React",
      "entry": "Today we started with a basic explanation of React, getting a React environment setup, and began the kennels application. I think learning React is gonna be AWESOME!!!!!!",
      "moodId": 1,
      "id": 14
    },
    {
      "id": 15,
      "date": "2020-10-03",
      "concept": "SAD TEST!!!!!!!",
      "entry": "Testing Filtering by Sad Mood",
      "moodId": 3
    }
  ],
  "moods": [
    {
      "id": 1,
      "label": "Happy"
    },
    {
      "id": 2,
      "label": "Ok"
    },
    {
      "id": 3,
      "label": "Sad"
    }
  ]
}